# ResetTextPosition Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DimensionSegment..::..ResetTextPosition Method
DimensionSegment Class See Also
---
Resets the text position of the segment to the initial position determined by its type and parameters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015 Subscription Update
# Syntax
C#
---
```text
public void ResetTextPosition()
```

Visual Basic
---
```text
Public Sub ResetTextPosition
```

Visual C++
---
```text
public:
void ResetTextPosition()
```

# Remarks
The initial point is the text location when dimension is created.
# See Also
DimensionSegment Class
Autodesk.Revit.DB Namespace